<script setup>

</script>

<template>
<section class="section about-project">
  <div class="container about-project__container">
    <div class="about-project__content">
      <h2 class="heading-2 about-project__title">
        <span>Струм</span> - це платформа вибору професії, яка допомагає молоді побудувати зрозумілий шлях до своєї роботи мрії
      </h2>
      <div class="about-project__description">
        <p class="about-project__description-text">Ми постійно оновлюємо інформацію про найновіші професії та тенденції на ринку праці, щоб показати кожному їх
          освітній та професійний шлях.</p>
        <p class="about-project__description-highlight">Приєднуйся, щоб розпочати свою подорож до улюбленої роботи.</p>
      </div>
      <span class="about-project__decoration">
        <svg width="431" height="256" viewBox="0 0 431 256" fill="none" xmlns="http://www.w3.org/2000/svg">
          <g clip-path="url(#clip0_147_532)">
            <path d="M393.716 34.4371L396.459 31.0307C397.614 29.5923 397.186 27.4579 395.566 26.5809C380.303 18.3044 365.368 13.1901 351.029 11.3487C336.759 9.51881 323.018 10.9107 310.2 15.4811C293.138 21.5668 282.155 31.7779 278.068 36.0781C277.013 37.1906 275.286 37.3069 274.088 36.3555L273.677 36.0291C272.319 34.9567 272.175 32.9522 273.358 31.6953C277.857 26.911 289.432 16.1531 307.712 9.55494C320.29 5.01579 333.665 3.32984 347.529 4.52167C348.885 4.64029 350.248 4.78332 351.617 4.95571C367.433 6.94954 383.862 12.6751 400.58 22.0094C401.836 22.711 403.419 22.3988 404.321 21.2788L407.527 17.2921C408.953 15.5197 411.769 15.9546 412.592 18.0752L416.577 28.3288L420.561 38.5823C421.384 40.7029 419.598 42.9174 417.35 42.5692L406.462 40.8856L395.575 39.202C393.326 38.8538 392.295 36.2044 393.721 34.4319L393.716 34.4371Z" fill="#E2FC52" stroke="#222222" stroke-miterlimit="10"/>
            <path d="M190.339 165.167C180.628 162.005 168.609 160.983 154.35 162.098C151.939 162.286 150.33 159.654 151.604 157.602C164.637 136.57 183.345 115.497 201.92 99.3419C203.136 98.2811 204.982 98.3864 206.063 99.5806L209.436 103.305C210.966 104.992 213.748 104.391 214.448 102.228L217.827 91.7591L221.206 81.2903C221.905 79.1273 219.994 77.0186 217.77 77.4946L207.002 79.8082L196.235 82.1218C194.006 82.603 193.134 85.3079 194.664 86.9948L197.787 90.4446C198.894 91.6672 198.79 93.5598 197.55 94.6415C176.944 112.622 157.24 135.66 144.534 156.919C143.42 158.78 142.364 160.624 141.361 162.441C140.919 163.243 140.139 163.793 139.235 163.94C121.437 166.814 100.813 172.406 77.4574 180.702C46.1685 191.816 19.3299 204.631 10.9779 208.737C9.49807 209.465 8.90026 211.262 9.64769 212.729L9.88195 213.183C10.6181 214.621 12.3679 215.205 13.8189 214.494C26.3888 208.334 82.0231 181.914 131.433 171.93C133.766 171.459 135.682 173.775 134.757 175.968C125.249 198.504 125.398 217.033 135.381 230.215C151.665 251.712 181.352 252.125 200.642 240.107C209.564 234.55 215.76 226.824 218.573 217.771C221.711 207.655 220.332 196.299 214.583 184.933C209.811 175.503 201.658 168.852 190.344 165.167L190.339 165.167ZM212.43 215.868C210.081 223.431 204.832 229.931 197.237 234.659C188.844 239.89 180.026 241.983 171.739 241.723C158.844 241.32 147.227 235.214 140.502 226.34C130.14 212.658 133.448 192.422 144.084 171.024C144.517 170.149 145.37 169.545 146.338 169.42C162.195 167.345 176.811 167.508 188.346 171.266C198.107 174.446 204.812 179.866 208.841 187.824C213.896 197.815 215.105 207.246 212.43 215.868Z" fill="#E2FC52" stroke="#222222" stroke-miterlimit="10"/>
            <path d="M254.947 58.6453C255.151 62.9602 251.814 66.6251 247.492 66.8298C243.169 67.0344 239.501 63.7012 239.296 59.3864C239.092 55.0715 242.429 51.4066 246.752 51.2019C251.074 50.9973 254.743 54.3305 254.947 58.6453Z" stroke="#222222"/>
          </g>
          <defs>
            <clipPath id="clip0_147_532">
              <rect width="419.595" height="236.391" fill="white" transform="translate(0 19.8455) rotate(-2.71092)"/>
            </clipPath>
          </defs>
        </svg>
      </span>
    </div>
  </div>
</section>
</template>
<style scoped lang="scss">
@import "@/styles/main.scss";
.about-project{
  &__content{
    width: 100%;
    position: relative;
  }
  &__decoration{
    position: absolute;
    right: -50px;
    bottom: -10px;
    z-index: 0;
    svg {
      transform: rotate(-3deg);
    }
  }
  &__title{
    position: relative;
    max-width: 1000px;
    text-align: start;
    z-index: 5;
  }
  &__description{
    position: relative;
    z-index: 5;
    max-width: 700px;
    &-text{
      margin-top: 20px;
    }
    &-highlight{
      margin-top: 20px;
      font-weight: 700;
      //color: $apple-green;
      color: $dark-jungle-green;
    }
  }
}

</style>