<script setup>
import HeroSection from "@/components/layout/HeroSection.vue";
import AboutProjectSection from "@/components/layout/AboutProjectSection.vue";
import FeaturesSection from "@/components/layout/FeaturesSection.vue";
import MentionsSection from "@/components/layout/MentionsSection.vue";

</script>

<template>
  <hero-section/>
  <about-project-section/>
  <features-section/>
  <mentions-section/>
  <hr class="home__line">
  <section class="section">
    <div class="container">У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль.</div>
  </section>
</template>

<style scoped lang="scss">
@import "@/styles/main.scss";
.home__line{
  //background-color: $alien-green;
  border: 3px solid $alien-green;
}
</style>