<script setup>

import SetButton from "@/components/setButton.vue";
import SearchPanelSection from "@/components/layout/SearchPanelSection.vue";
</script>

<template>
  <search-panel-section/>
  <section class="section">
    <div class="container">
      <div  style="margin-bottom: 20px">
        <set-button color="dark" animation="light-dark" :url="{name: 'profession', params: {id: '1'}}" label="Сторінка професії"/>
      </div>
      <p>У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль. У сучасному світі технологій та інновацій важливо розуміти, як адаптуватися до змін. Розвиток науки та освіти є ключовими факторами у формуванні майбутнього. Кожна людина повинна прагнути до самовдосконалення та відкриття нових горизонтів. Цей шлях може бути важким, але він вартий зусиль.</p>
    </div>
  </section>
</template>

<style scoped lang="scss">

</style>